#+title: Simple pendulum
#+setupfile: ~/Dropbox/Templates/physics.org
This is an simple pendulum system example. The focus here is more
in learning a little o =Fortran= and =org-mode= great features
for writting scientific documents (like export for =.pdf=).

* Equations 
  \[ \omega_{i+1} = w_i - \frac{g}{l}\cdot  \theta _i \cdot  \Delta t \]
  \[ \theta _{i+1} = \theta _i + \omega_i \cdot  \Delta t  \]
* Fortran Code
#+begin_src fortran 
  implicit none
  integer, parameter :: n = 500
  real, parameter :: g = 9.81
  real, parameter :: l = 1.0
  real, dimension(n) :: w, t
  real, dimension(n) :: theta
  real, parameter :: dt = 0.02
  integer :: i
  theta(1) = 0.02
  w(1) = 0
  t(1) = 0
  do i = 1, n-1
     w(i+1) = w(i) - (g/l) * theta(i) * dt
     theta(i+1) = theta(i) + w(i+1) * dt
     t(i+1) = t(i) + dt
  end do  
  do i = 1, n
     print *, t(i) ,  theta(i)
  end do
#+end_src

#+RESULTS:
|          0.0 |    0.0199999996 |
| 0.0199999996 |    0.0199215189 |
| 0.0399999991 |    0.0197648667 |
| 0.0599999987 |    0.0195306577 |
| 0.0799999982 |    0.0192198101 |
|  0.099999994 |    0.0188335441 |
|   0.11999999 |    0.0183733758 |
|  0.139999986 |      0.01784111 |
|  0.159999982 |    0.0172388349 |
|  0.179999977 |    0.0165689141 |
|  0.199999973 |    0.0158339776 |
|  0.219999969 |    0.0150369089 |
|  0.239999965 |    0.0141808353 |
|  0.259999961 |    0.0132691162 |
|  0.279999971 |    0.0123053286 |
|  0.299999982 |    0.0112932548 |
|  0.319999993 |    0.0102368668 |
|  0.340000004 |   0.00914030895 |
|  0.360000014 |   0.00800788496 |
|  0.380000025 |   0.00684403768 |
|  0.400000036 |   0.00565333478 |
|  0.420000046 |   0.00444044825 |
|  0.440000057 |   0.00321013713 |
|  0.460000068 |   0.00196722941 |
|  0.480000079 |   0.00071660243 |
|   0.50000006 | -0.000536836567 |
|  0.520000041 |  -0.00178816903 |
|  0.540000021 |  -0.00303248456 |
|  0.560000002 |  -0.00426490046 |
|  0.579999983 |  -0.00548058096 |
|  0.599999964 |  -0.00667475583 |
|  0.619999945 |  -0.00784273911 |
|  0.639999926 |  -0.00897994731 |
|  0.659999907 |    -0.010081918 |
|  0.679999888 |    -0.011144327 |
|  0.699999869 |   -0.0121630058 |
|   0.71999985 |   -0.0131339571 |
|  0.739999831 |   -0.0140533708 |
|  0.759999812 |   -0.0149176391 |
|  0.779999793 |     -0.01572337 |
|  0.799999774 |   -0.0164674036 |
|  0.819999754 |   -0.0171468183 |
|  0.839999735 |   -0.0177589487 |
|  0.859999716 |   -0.0183013938 |
|  0.879999697 |   -0.0187720247 |
|  0.899999678 |   -0.0191689935 |
|  0.919999659 |   -0.0194907431 |
|   0.93999964 |   -0.0197360106 |
|  0.959999621 |   -0.0199038349 |
|  0.979999602 |   -0.0199935567 |
|  0.999999583 |   -0.0200048238 |
|   1.01999962 |   -0.0199375916 |
|    1.0399996 |   -0.0197921246 |
|   1.05999959 |   -0.0195689928 |
|   1.07999957 |   -0.0192690715 |
|   1.09999955 |   -0.0188935399 |
|   1.11999953 |   -0.0184438694 |
|   1.13999951 |   -0.0179218259 |
|   1.15999949 |   -0.0173294563 |
|   1.17999947 |   -0.0166690852 |
|   1.19999945 |   -0.0159433056 |
|   1.21999943 |   -0.0151549643 |
|   1.23999941 |   -0.0143071543 |
|   1.25999939 |   -0.0134032033 |
|   1.27999938 |   -0.0124466587 |
|   1.29999936 |   -0.0114412727 |
|   1.31999934 |   -0.0103909913 |
|   1.33999932 |  -0.00929993577 |
|    1.3599993 |  -0.00817238726 |
|   1.37999928 |  -0.00701277051 |
|   1.39999926 |  -0.00582563551 |
|   1.41999924 |  -0.00461564073 |
|   1.43999922 |  -0.00338753406 |
|    1.4599992 |  -0.00214613485 |
|   1.47999918 | -0.000896314159 |
|   1.49999917 |  0.000357023673 |
|   1.51999915 |   0.00160896045 |
|   1.53999913 |   0.00285458378 |
|   1.55999911 |   0.00408900576 |
|   1.57999909 |   0.00530738244 |
|   1.59999907 |   0.00650493288 |
|   1.61999905 |   0.00767695811 |
|   1.63999903 |   0.00881885923 |
|   1.65999901 |   0.00992615521 |
|   1.67999899 |    0.0109945005 |
|   1.69999897 |    0.0120197032 |
|   1.71999896 |    0.0129977409 |
|   1.73999894 |    0.0139247756 |
|   1.75999892 |    0.0147971688 |
|    1.7799989 |    0.0156114986 |
|   1.79999888 |    0.0163645688 |
|   1.81999886 |    0.0170534234 |
|   1.83999884 |    0.0176753607 |
|   1.85999882 |    0.0182279404 |
|    1.8799988 |    0.0187089927 |
|   1.89999878 |    0.0191166326 |
|   1.91999876 |    0.0194492582 |
|   1.93999875 |    0.0197055656 |
|   1.95999873 |    0.0198845472 |
|   1.97999871 |    0.0199855026 |
|   1.99999869 |     0.020008035 |
|   2.01999879 |    0.0199520551 |
|   2.03999877 |    0.0198177844 |
|   2.05999875 |    0.0196057484 |
|   2.07999873 |    0.0193167794 |
|   2.09999871 |    0.0189520102 |
|   2.11999869 |    0.0185128748 |
|   2.13999867 |    0.0180010945 |
|   2.15999866 |     0.017418677 |
|   2.17999864 |    0.0167679098 |
|   2.19999862 |    0.0160513446 |
|    2.2199986 |    0.0152717941 |
|   2.23999858 |    0.0144323166 |
|   2.25999856 |    0.0135362074 |
|   2.27999854 |     0.012586982 |
|   2.29999852 |    0.0115883648 |
|    2.3199985 |    0.0105442749 |
|   2.33999848 |   0.00945880916 |
|   2.35999846 |   0.00833622739 |
|   2.37999845 |   0.00718093431 |
|   2.39999843 |   0.00599746313 |
|   2.41999841 |    0.0047904579 |
|   2.43999839 |   0.00356465485 |
|   2.45999837 |   0.00232486427 |
|   2.47999835 |   0.00107595068 |
|   2.49999833 | -0.000177184935 |
|   2.51999831 |  -0.00142962532 |
|   2.53999829 |  -0.00267645577 |
|   2.55999827 |  -0.00391278369 |
|   2.57999825 |  -0.00513375783 |
|   2.59999824 |    -0.006334587 |
|   2.61999822 |  -0.00751055963 |
|    2.6399982 |  -0.00865706056 |
|   2.65999818 |   -0.0097695915 |
|   2.67999816 |   -0.0108437864 |
|   2.69999814 |   -0.0118754301 |
|   2.71999812 |   -0.0128604751 |
|    2.7399981 |   -0.0137950554 |
|   2.75999808 |   -0.0146755036 |
|   2.77999806 |   -0.0154983653 |
|   2.79999804 |   -0.0162604116 |
|   2.81999803 |   -0.0169586521 |
|   2.83999801 |   -0.0175903458 |
|   2.85999799 |   -0.0181530155 |
|   2.87999797 |   -0.0186444521 |
|   2.89999795 |   -0.0190627296 |
|   2.91999793 |   -0.0194062032 |
|   2.93999791 |   -0.0196735281 |
|   2.95999789 |   -0.0198636539 |
|   2.97999787 |   -0.0199758355 |
|   2.99999785 |   -0.0200096313 |
|   3.01999784 |   -0.0199649092 |
|   3.03999782 |   -0.0198418442 |
|    3.0599978 |   -0.0196409207 |
|   3.07999778 |   -0.0193629265 |
|   3.09999776 |   -0.0190089513 |
|   3.11999774 |   -0.0185803846 |
|   3.13999772 |   -0.0180789083 |
|    3.1599977 |   -0.0175064914 |
|   3.17999768 |   -0.0168653782 |
|   3.19999766 |   -0.0161580853 |
|   3.21999764 |   -0.0153873889 |
|   3.23999763 |    -0.014556312 |
|   3.25999761 |   -0.0136681162 |
|   3.27999759 |   -0.0127262864 |
|   3.29999757 |   -0.0117345192 |
|   3.31999755 |   -0.0106967054 |
|   3.33999753 |  -0.00961691793 |
|   3.35999751 |  -0.00849939324 |
|   3.37999749 |  -0.00734851696 |
|   3.39999747 |  -0.00616880506 |
|   3.41999745 |  -0.00496488716 |
|   3.43999743 |  -0.00374148693 |
|   3.45999742 |  -0.00250340486 |
|    3.4799974 |  -0.00125549955 |
|   3.49999738 |  -2.6676571e-06 |
|   3.51999736 |   0.00125017471 |
|   3.53999734 |   0.00249811122 |
|   3.55999732 |   0.00373624545 |
|    3.5799973 |   0.00495971832 |
|   3.59999728 |   0.00616372935 |
|   3.61999726 |   0.00734355394 |
|   3.63999724 |   0.00849456247 |
|   3.65999722 |   0.00961223803 |
|   3.67999721 |     0.010692196 |
|   3.69999719 |    0.0117301978 |
|   3.71999717 |      0.01272217 |
|   3.73999715 |    0.0136642205 |
|   3.75999713 |    0.0145526519 |
|   3.77999711 |    0.0153839793 |
|   3.79999709 |    0.0161549393 |
|   3.81999707 |    0.0168625079 |
|   3.83999705 |    0.0175039079 |
|   3.85999703 |    0.0180766229 |
|   3.87999701 |    0.0185784046 |
|     3.899997 |    0.0190072842 |
|   3.91999698 |    0.0193615798 |
|   3.93999696 |       0.0196399 |
|   3.95999694 |    0.0198411532 |
|   3.97999692 |    0.0199645497 |
|    3.9999969 |    0.0200096052 |
|   4.01999712 |    0.0199761447 |
|    4.0399971 |    0.0198642965 |
|   4.05999708 |    0.0196745023 |
|   4.07999706 |    0.0194075052 |
|   4.09999704 |    0.0190643519 |
|   4.11999702 |    0.0186463911 |
|   4.13999701 |    0.0181552619 |
|   4.15999699 |    0.0175928902 |
|   4.17999697 |    0.0169614851 |
|   4.19999695 |    0.0162635222 |
|   4.21999693 |    0.0155017413 |
|   4.23999691 |     0.014679132 |
|   4.25999689 |    0.0137989214 |
|   4.27999687 |    0.0128645645 |
|   4.29999685 |    0.0118797272 |
|   4.31999683 |    0.0108482735 |
|   4.33999681 |   0.00977425091 |
|    4.3599968 |   0.00866187457 |
|   4.37999678 |   0.00751550868 |
|   4.39999676 |     0.006339652 |
|   4.41999674 |   0.00513891876 |
|   4.43999672 |   0.00391802005 |
|    4.4599967 |   0.00268174708 |
|   4.47999668 |   0.00143495097 |
|   4.49999666 |  0.000182524091 |
|   4.51999664 |   -0.0010706191 |
|   4.53999662 |  -0.00231956132 |
|    4.5599966 |  -0.00355940149 |
|   4.57999659 |  -0.00478527462 |
|   4.59999657 |  -0.00599237019 |
|   4.61999655 |  -0.00717595173 |
|   4.63999653 |   -0.0083313752 |
|   4.65999651 |  -0.00945410598 |
|   4.67999649 |   -0.0105397394 |
|   4.69999647 |   -0.0115840146 |
|   4.71999645 |   -0.0125828339 |
|   4.73999643 |   -0.0135322781 |
|   4.75999641 |   -0.0144286221 |
|    4.7799964 |   -0.0152683482 |
|   4.79999638 |   -0.0160481613 |
|   4.81999636 |   -0.0167650003 |
|   4.83999634 |   -0.0174160544 |
|   4.85999632 |    -0.017998768 |
|    4.8799963 |   -0.0185108539 |
|   4.89999628 |    -0.018950304 |
|   4.91999626 |   -0.0193153918 |
|   4.93999624 |   -0.0196046866 |
|   4.95999622 |   -0.0198170524 |
|    4.9799962 |   -0.0199516565 |
|   4.99999619 |   -0.0200079698 |
|   5.01999617 |   -0.0199857727 |
|   5.03999615 |   -0.0198851507 |
|   5.05999613 |   -0.0197064988 |
|   5.07999611 |   -0.0194505192 |
|   5.09999609 |   -0.0191182159 |
|   5.11999607 |   -0.0187108926 |
|   5.13999605 |   -0.0182301477 |
|   5.15999603 |   -0.0176778678 |
|   5.17999601 |   -0.0170562193 |
|   5.19999599 |   -0.0163676422 |
|   5.21999598 |   -0.0156148393 |
|   5.23999596 |   -0.0148007637 |
|   5.25999594 |   -0.0139286099 |
|   5.27999592 |   -0.0130018005 |
|    5.2999959 |   -0.0120239714 |
|   5.31999588 |   -0.0109989606 |
|   5.33999586 |  -0.00993078947 |
|   5.35999584 |  -0.00882364996 |
|   5.37999582 |  -0.00768188667 |
|    5.3999958 |  -0.00650997972 |
|   5.41999578 |  -0.00531252753 |
|   5.43999577 |  -0.00409422908 |
|   5.45999575 |  -0.00285986485 |
|   5.47999573 |  -0.00161427865 |
|   5.49999571 |  -0.00036235794 |
|   5.51999569 |  0.000890984666 |
|   5.53999567 |   0.00214083097 |
|   5.55999565 |   0.00338227674 |
|   5.57999563 |   0.00461045047 |
|   5.59999561 |    0.0058205328 |
|   5.61999559 |   0.00700777536 |
|   5.63999557 |   0.00816751923 |
|   5.65999556 |   0.00929521397 |
|   5.67999554 |    0.0103864344 |
|   5.69999552 |    0.0114368983 |
|    5.7199955 |    0.0124424836 |
|   5.73999548 |    0.0133992443 |
|   5.75999546 |    0.0143034272 |
|   5.77999544 |     0.015151483 |
|   5.79999542 |    0.0159400851 |
|    5.8199954 |    0.0166661367 |
|   5.83999538 |    0.0173267908 |
|   5.85999537 |    0.0179194547 |
|   5.87999535 |    0.0184418038 |
|   5.89999533 |    0.0188917872 |
|   5.91999531 |    0.0192676391 |
|   5.93999529 |    0.0195678845 |
|   5.95999527 |     0.019791346 |
|   5.97999525 |    0.0199371465 |
|   5.99999523 |     0.020004712 |
|   6.01999521 |    0.0199937802 |
|   6.03999519 |    0.0199043918 |
|   6.05999517 |    0.0197368991 |
|   6.07999516 |    0.0194919594 |
|   6.09999514 |     0.019170532 |
|   6.11999512 |    0.0187738799 |
|    6.1399951 |    0.0183035582 |
|   6.15999508 |    0.0177614149 |
|   6.17999506 |    0.0171495751 |
|   6.19999504 |    0.0164704397 |
|   6.21999502 |    0.0157266743 |
|     6.239995 |    0.0149211986 |
|   6.25999498 |    0.0140571715 |
|   6.27999496 |    0.0131379841 |
|   6.29999495 |    0.0121672433 |
|   6.31999493 |    0.0111487582 |
|   6.33999491 |    0.0100865252 |
|   6.35999489 |   0.00898471288 |
|   6.37999487 |   0.00784764439 |
|   6.39999485 |   0.00667978218 |
|   6.41999483 |   0.00548570836 |
|   6.43999481 |   0.00427010888 |
|   6.45999479 |   0.00303775351 |
|   6.47999477 |   0.00179347792 |
|   6.49999475 |  0.000542164664 |
|   6.51999474 | -0.000711275963 |
|   6.53999472 |  -0.00196192553 |
|    6.5599947 |  -0.00320487656 |
|   6.57999468 |  -0.00443525147 |
|   6.59999466 |  -0.00564822275 |
|   6.61999464 |  -0.00683903042 |
|   6.63999462 |  -0.00800300203 |
|    6.6599946 |  -0.00913556945 |
|   6.67999458 |   -0.0102322893 |
|   6.69999456 |   -0.0112888571 |
|   6.71999454 |   -0.0123011274 |
|   6.73999453 |   -0.0132651282 |
|   6.75999451 |   -0.0141770765 |
|   6.77999449 |   -0.0150333941 |
|   6.79999447 |   -0.0158307217 |
|   6.81999445 |   -0.0165659282 |
|   6.83999443 |   -0.0172361303 |
|   6.85999441 |   -0.0178386979 |
|   6.87999439 |   -0.0183712672 |
|   6.89999437 |   -0.0188317467 |
|   6.91999435 |   -0.0192183312 |
|   6.93999434 |   -0.0195295028 |
|   6.95999432 |   -0.0197640397 |
|    6.9799943 |   -0.0199210234 |
|   6.99999428 |   -0.0199998375 |
|   7.01999426 |   -0.0200001709 |
|   7.03999424 |   -0.0199220236 |
|   7.05999422 |    -0.019765703 |
|    7.0799942 |   -0.0195318218 |
|   7.09999418 |   -0.0192212984 |
|   7.11999416 |    -0.018835349 |
|   7.13999414 |   -0.0183754899 |
|   7.15999413 |   -0.0178435259 |
|   7.17999411 |   -0.0172415432 |
|   7.19999409 |   -0.0165719055 |
|   7.21999407 |   -0.0158372391 |
|   7.23999405 |   -0.0150404274 |
|   7.25999403 |   -0.0141845979 |
|   7.27999401 |   -0.0132731078 |
|   7.29999399 |   -0.0123095335 |
|   7.31999397 |   -0.0112976572 |
|   7.33999395 |   -0.0102414489 |
|   7.35999393 |   -0.0091450531 |
|   7.37999392 |  -0.00801277161 |
|    7.3999939 |  -0.00684904819 |
|   7.41999388 |  -0.00565844914 |
|   7.43999386 |  -0.00444564642 |
|   7.45999384 |  -0.00321539911 |
|   7.47999382 |  -0.00197253446 |
|    7.4999938 | -0.000721929478 |
|   7.51999378 |  0.000531508354 |
|   7.53999376 |   0.00178286061 |
|   7.55999374 |     0.003027217 |
|   7.57999372 |   0.00425969437 |
|   7.59999371 |   0.00547545683 |
|   7.61999369 |   0.00666973367 |
|   7.63999367 |   0.00783783849 |
|   7.65999365 |   0.00897518732 |
|   7.67999363 |    0.0100773182 |
|   7.69999361 |    0.0111399051 |
|   7.71999359 |    0.0121587794 |
|   7.73999357 |    0.0131299421 |
|   7.75999355 |    0.0140495831 |
|   7.77999353 |    0.0149140935 |
|   7.79999352 |    0.0157200806 |
|    7.8199935 |    0.0164643824 |
|   7.83999348 |    0.0171440784 |
|   7.85999346 |    0.0177565012 |
|   7.87999344 |    0.0182992481 |
|   7.89999342 |    0.0187701881 |
|    7.9199934 |    0.0191674735 |
|   7.93999338 |    0.0194895454 |
|   7.95999336 |    0.0197351407 |
|   7.97999334 |    0.0199032947 |
|   7.99999332 |     0.019993348 |
|   8.01999378 |    0.0200049486 |
|   8.03999424 |    0.0199380498 |
|    8.0599947 |    0.0197929144 |
|   8.07999516 |    0.0195701104 |
|   8.09999561 |    0.0192705132 |
|   8.11999607 |    0.0188952982 |
|   8.13999653 |    0.0184459388 |
|   8.15999699 |     0.017924197 |
|   8.17999744 |    0.0173321217 |
|    8.1999979 |    0.0166720357 |
|   8.21999836 |    0.0159465279 |
|   8.23999882 |    0.0151584456 |
|   8.25999928 |    0.0143108815 |
|   8.27999973 |    0.0134071615 |
|   8.30000019 |    0.0124508319 |
|   8.32000065 |    0.0114456452 |
|   8.34000111 |    0.0103955455 |
|   8.36000156 |   0.00930465385 |
|   8.38000202 |   0.00817725062 |
|   8.40000248 |   0.00701776007 |
|   8.42000294 |   0.00583073217 |
|    8.4400034 |   0.00462082401 |
|   8.46000385 |   0.00339278392 |
|   8.48000431 |   0.00215143058 |
|   8.50000477 |  0.000901635038 |
|   8.52000523 | -0.000351698487 |
|   8.54000568 |  -0.00160365202 |
|   8.56000614 |  -0.00284931273 |
|    8.5800066 |  -0.00408379268 |
|   8.60000706 |  -0.00530224806 |
|   8.62000751 |  -0.00649989722 |
|   8.64000797 |  -0.00767204072 |
|   8.66000843 |  -0.00881407969 |
|   8.68000889 |  -0.00992153212 |
|   8.70000935 |   -0.0109900525 |
|    8.7200098 |    -0.012015448 |
|   8.74001026 |   -0.0129936943 |
|   8.76001072 |   -0.0139209535 |
|   8.78001118 |   -0.0147935869 |
|   8.80001163 |   -0.0156081701 |
|   8.82001209 |   -0.0163615067 |
|   8.84001255 |   -0.0170506407 |
|   8.86001301 |   -0.0176728684 |
|   8.88001347 |   -0.0182257481 |
|   8.90001392 |   -0.0187071096 |
|   8.92001438 |   -0.0191150643 |
|   8.94001484 |   -0.0194480121 |
|    8.9600153 |   -0.0197046455 |
|   8.98001575 |   -0.0198839586 |
|   9.00001621 |   -0.0199852455 |
|   9.02001667 |   -0.0200081114 |
|   9.04001713 |   -0.0199524648 |
|   9.06001759 |   -0.0198185258 |
|   9.08001804 |   -0.0196068175 |
|    9.1000185 |   -0.0193181727 |
|   9.12001896 |   -0.0189537238 |
|   9.14001942 |   -0.0185148995 |
|   9.16001987 |   -0.0180034228 |
|   9.18002033 |   -0.0174213015 |
|   9.20002079 |   -0.0167708192 |
|   9.22002125 |   -0.0160545278 |
|   9.24002171 |   -0.0152752381 |
|   9.26002216 |   -0.0144360084 |
|   9.28002262 |    -0.013540132 |
|   9.30002308 |   -0.0125911245 |
|   9.32002354 |   -0.0115927095 |
|   9.34002399 |    -0.010548804 |
|   9.36002445 |  -0.00946350582 |
|   9.38002491 |  -0.00834107213 |
|   9.40002537 |  -0.00718590803 |
|   9.42002583 |  -0.00600254675 |
|   9.44002628 |  -0.00479563139 |
|   9.46002674 |   -0.0035698982 |
|    9.4800272 |  -0.00233015651 |
|   9.50002766 |  -0.00108127133 |
|   9.52002811 |  0.000171856722 |
|   9.54002857 |   0.00142431026 |
|   9.56002903 |   0.00267117494 |
|   9.58002949 |   0.00390755758 |
|   9.60002995 |   0.00512860715 |
|    9.6200304 |   0.00632953225 |
|   9.64003086 |    0.0075056199 |
|   9.66003132 |   0.00865225587 |
|   9.68003178 |   0.00976494048 |
|   9.70003223 |    0.0108393077 |
|   9.72003269 |    0.0118711414 |
|   9.74003315 |    0.0128563922 |
|   9.76003361 |    0.0137911951 |
|   9.78003407 |    0.0146718808 |
|   9.80003452 |    0.0154949939 |
|   9.82003498 |    0.0162573047 |
|   9.84003544 |    0.0169558227 |
|    9.8600359 |    0.0175878052 |
|   9.88003635 |    0.0181507729 |
|   9.90003681 |    0.0186425168 |
|   9.92003727 |    0.0190611091 |
|   9.94003773 |    0.0194049049 |
|   9.96003819 |    0.0196725558 |
|   9.98003864 |    0.0198630113 |

* Plotting with Gnuplot :noexport:
#+begin_src gnuplot :var data=table_pendulum :file output.tex :exports file 
  set terminal epslatex standalone size 8cm,8cm

  set xrange[*:*] noreverse writeback
  set yrange[*:*] noreverse writeback

  set grid
  set style line 1 lt 1 lc "black" lw 2
  set key right top

  set xlabel "Time"
  set ylabel "Angle"

  plot data using 1:2 with line ls 1
#+end_src
#+RESULTS:
[[file:output.tex]]
#+attr_latex: :width 8cm
#+caption: Gráfico da variação angular sobre o tempo.
[[file:output.pdf]]
* C++ code  :noexport:
#+begin_src C++ :includes <stdio.h> :cache yes 
  const int n = 100;
  const float g = 9.81;
  const float l = 1.0;
  const double dt = 0.03;

  double w[n];
  double t[n];

  w[0] = 0.0;
  t[0] = 0.0;

  double theta[n];
  theta[0] = 0.2;
  int i = 0;
  while ( i < n ) {
      w[i+1] = w[i] - (g/l) * theta[i] * dt;
      theta[i+1] = theta[i] + w[i+1] * dt;
      t[i+1] = t[i] + dt;
      i++;
  }

  for(int i = 0; i < n; i++)
      printf("%.6f %.6f \n", t[i],theta[i]);
#+end_src

